app/views/consulta/_form.html.erb

    <%= form.label :paciente_id, style: "display: block" %>
    <%= form.collection_select :paciente_id, Paciente.all, :id, :nome %>
---
SELECT "pacientes".* FROM "pacientes"