app/controllers/acesso_paciente_controller.rb

  def create
    @paciente= Paciente.find_by(cpf: params[:cpf])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."cpf" = ? LIMIT ?  [["cpf", "135.469.494-55"], ["LIMIT", 1]]