app/controllers/admin_controller.rb

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]