app/controllers/consulta_controller.rb

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @paciente = Paciente.find(consultum_params[:paciente_id])

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_consultum
    current_paciente = Paciente.find(session[:paciente_id])