app/controllers/login_controller.rb

    def create
        @admin= Admin.find_by(usuario: params[:usuario])
---
SELECT "admins".* FROM "admins" WHERE "admins"."usuario" = ? LIMIT ?  [["usuario", "Admin_padrao"], ["LIMIT", 1]]