app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.endereco_paciente = EnderecoPaciente.new(paciente_params[:endereco_paciente_attributes])
    respond_to do |format|
      if @paciente.save
---
INSERT INTO "endereco_pacientes" ("cep", "cidade", "bairro", "logradouro", "complemento", "created_at", "updated_at", "paciente_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pacientes" ("nome", "nascimento", "cpf", "telefone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @paciente.update(paciente_params)
---
UPDATE "pacientes" SET "cpf" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["cpf", "703.831.67450"], ["updated_at", "2023-03-05 05:17:52.194694"], ["id", 11]]

  def destroy
    @paciente.destroy
---
DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 1]]

    def set_paciente
      @paciente = Paciente.find(params[:id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]